Repository: nijel/odorik
Catalog: docs/locale/*/LC_MESSAGES/command.po
Languages: cs

source: Odorik command line interface
cs: Rozhraní Odorik pro příkazovou řádku

source: Synopsis
cs: Použití

source: Commands actually indicate which operation should be performed.
cs: Jednotlivé příkazy určují jaká operace se provede.

source: Description
cs: Popis

source: This module also installs :program:`odorik` program, which allows you to easily access some of the functionality from command line.
cs: Tento modul také nainstaluje program :program:`odorik`, který vám ho umožní používat z příkazové řádky.

source: Global options
cs: Globální volby

source: The program accepts following global options, which must be entered before subcommand.
cs: Program rozumí následujícím globálním volbám. Tyto musí být zadány před příkazem.

source: Specify output format.
cs: Určí výstupní formát.

source: Specify API URL. Overrides value from configuration file, see :ref:`files`.
cs: Nastaví API URL. Přepíše hodnotu z konfiguračního souboru, viz :ref:`files`.

source: Specify API user. Overrides value from configuration file, see :ref:`files`.
cs: Nastaví API uživatele. Přepíše hodnotu z konfiguračního souboru, viz :ref:`files`.

source: Specify API password. Overrides value from configuration file, see :ref:`files`.
cs: Nastaví API heslo. Přepíše hodnotu z konfiguračního souboru, viz :ref:`files`.

source: Override path to configuration file, see :ref:`files`.
cs: Cesta ke konfiguračnímu souboru, viz :ref:`files`.

source: Override section to use in configuration file, see :ref:`files`.
cs: Sekce v konfiguračním souboru, viz :ref:`files`.

source: Subcommands
cs: Příkazy

source: Currently following subcommands are available:
cs: V současné době jsou k dispozici tyto příkazy:

source: Prints current version.
cs: Vypíše verzi programu.

source: Performs authenticated API call. By default ``GET`` method is used, with ``--post`` it is ``POST``.
cs: Provede autentizované volání API. Jako výchozí se použije metoda ``GET``, volbou ``--post`` ji změníte na ``POST``.

source: Additional parameters can be specified by ``--param`` switch which can be used multiple times.
cs: Další parametry můžete zadat volbou ``--param``, která může být uvedena vícekrát.

source: Prints current balance.
cs: Vypíše aktuální zůstatek.

source: Prints mobile data usage.
cs: Vypíše použití mobilních dat.

source: It can list all individual records when ``--list`` is specified.
cs: S parametrem ``--list`` vypíše i jednotlivé položky.

source: The result can be also limited to given phone number by using ``--phone``. The phone number has to be specified as ``00420789123456``.
cs: Výsledek může být také omezen na telefonní číslo zadáním volby ``--phone``. Telefonní číslo zadávejte ve tvaru ``00420789123456``.

source: If ``--all`` is specified, summary for all mobile lines on current account is printed.
cs: Pokud použijete volbu ``--all``, program vypíše souhrn pro všechny linky na účtu.

source: See :ref:`interval` for information how to specify date period.
cs: Informace o zadání intervalu dat naleznete v :ref:`interval`.

source: Prints calls usage.
cs: Vypíše hovory.

source: The result can be also limited to given line by using ``--line``.
cs: Výsledek může být také omezen na jednu linku použitím ``--line``.

source: Prints SMS usage.
cs: Vypíše SMS zprávy.

source: Sends a SMS message.
cs: Odešle SMS zprávu.

source: You can specify sender number by ``--sender``, it has to be one of allowed values. By default ``5517`` is used.
cs: Číslo odesílatele můžete změnit pomocí ``--sender``. Musí se jednat o jednu z povolených hodnot. Jako výchozí se použije ``5517``.

source: Initiates a callback.
cs: Objedná zpětné volání.

source: Prints infromation about lines.
cs: Vypíše informace o linkách.

source: With ``--generate-config`` it generates config file entries for line and phone number aliases, see :ref:`files`.
cs: S volbou ``--generate-config`` tento příkaz vytvoří položky do konfiguračního souboru pro pojmenování linek a telefonních čísel, viz :ref:`files`.

source: Prints summary information for all lines in current account.
cs: Vypíše souhrnné informace o všech linkách pod účtem.

source: Specifying date period
cs: Zadávání časového intervalu

source: You can specify date period for which many commands will be issued:
cs: Pro mnoho příkazů můžete zadat časový interval na který se budou aplikovat:

source: Prints information for current month. This is the default interval.
cs: Vypíše informace pro tento měsíc. Jedná se o výchozí interval.

source: Prints information for last month.
cs: Vypíše informace pro minulý měsíc.

source: Starting datetime.
cs: Počáteční datum.

source: Ending datetime. If not specified, current date is used.
cs: Koncové datum. Pokud nebude zadáno použije se aktuální.

source: All parameters accepting date can take almost any format of date or timestamp. Check `dateutil <http://labix.org/python-dateutil#head-b95ce2094d189a89f80f5ae52a05b4ab7b41af47>`_ documentation for more detailed information (especially on year/month/day precendence).
cs: Všechny volby zpracují datum nebo čas v téměř jakémkoliv formátu. V dokumentaci k `dateutil <http://labix.org/python-dateutil#head-b95ce2094d189a89f80f5ae52a05b4ab7b41af47>`_ naleznete podrobnější popis (obzvlášť popis pořadí roku, měsíce a dne).

source: Files
cs: Soubory

source: User configuration file
cs: Konfigurační soubor uživatele

source: Global configration file
cs: Systémový konfigurační soubor

source: The program follows XDG specification, so you can adjust placement of config files by environment variables ``XDG_CONFIG_HOME`` or ``XDG_CONFIG_DIRS``.
cs: Program dodržuje specifikaci XDG, takže umístění konfiguračních souborů můžete ovlivnit proměnnými prostředí ``XDG_CONFIG_HOME`` nebo ``XDG_CONFIG_DIRS``.

source: API user, can be either ID registered user or line ID.
cs: API uživatel, může být buď ID uživatele nebo linky.

source: API password. Use API password for per user access and line password (used for SIP as well) for line access.
cs: API heslo. Použijte API heslo pro uživatele nebo heslo linky (stejné jako pro SIP) pro přístup na linku.

source: API server URL, defaults to ``https://www.odorik.cz/api/v1/``.
cs: URL API serveru, výchozí je ``https://www.odorik.cz/api/v1/``.

source: See `Autentizace Odorik API <http://www.odorik.cz/w/api#autentizace>`_ for more details on authentication.
cs: Více informací naleznete na wiki v sekci `Autentizace Odorik API <http://www.odorik.cz/w/api#autentizace>`_.

source: The configuration file is INI file, for example:
cs: Konfigurační soubor je ve formátu INI. Například může vypadat takto:

source: Additionally config file can include phone number and line aliases:
cs: Dále může konfigurační soubor obsahovat pojmenování pro telefonní čísla a linky:

source: Examples
cs: Příklady

source: Print current program version:
cs: Vypsat verzi programu:

source: Print current user balance:
cs: Vypsat aktuální zůstatek:

source: Prints current mobile data usage:
cs: Vypsat aktuální využití mobilních dat:

source: Sending message:
cs: Odeslání zprávy:

source: Initiating callback:
cs: Objednání zpětného volání:

source: Getting account summary:
cs: Výpis souhrnných informací o účtu:

source: Generic API usage:
cs: Obecné použití API:

source: Generic API POST:
cs: Obecné použití POST API:

source: Machine readable output formats:
cs: Strojově zpracovatelné výstupní formáty:

source: Following settings can be configured in the ``[odorik]`` section (you can customize this by :option:`--config-section`):
cs: Následující parametry mohou být nastaveny v sekci ``[odorik]`` (nebo vámi zadané pomocí volby :option:`--config-section`):
