Repository: nijel/odorik
Catalog: docs/locale/*/LC_MESSAGES/develop.po
Languages: cs

source: Developing
cs: Vývoj

source: Source code
cs: Zdrojový kód

source: The project is being developed on GitHub: https://github.com/nijel/odorik
cs: Projekt je vyvíjen na GitHubu: https://github.com/nijel/odorik

source: Issue tracker
cs: Sledování chyb

source: Issue tracker is hosted on GitHub: https://github.com/nijel/odorik/issues
cs: Systém pro sledování chyb je hostován na GitHubu: https://github.com/nijel/odorik/issues

source: Testsuite
cs: Testování

source: The testsuite can be executed using ``py.test``.
cs: Testy můžete spustit pomocí ``py.test``.

source: Continuous integration
cs: Průběžná integrace

source: We're using several services to ensure our code is healthy:
cs: Pro ověření kvality kódu používáme několik služeb:

source: Travis CI for running the testsuite
cs: Travis CI spouští testy po každé změně

source: Landscape for checking quality of our code
cs: Landscape kontroluje kvalitu kódu

source: Codecov for reporting the testsuite coverage
cs: Codecov kontroluje pokrytí kódu testy
