Repository: nijel/odorik
Catalog: docs/locale/*/LC_MESSAGES/news.po
Languages: cs

source: Changes
cs: Změny

source: Documentation translated to Czech language.
cs: Přeložena dokumentace do češtiny.

source: More detailed summaries for calls and messages.
cs: Podrobnější souhrny pro hovory a zprávy.

source: Added options for filtering calls by status and direction.
cs: Přidána možnost filtrovat hovory podle stavu a směru.

source: Adjustable date periods for commands.
cs: Nastavitelné časové intervaly pro příkazy.

source: Add support for listing calls.
cs: Přidána podpora pro výpis hovorů.

source: Add support for listing SMS.
cs: Přidána podpora pro výpis SMS.

source: Add support for using names for phone numbers and lines.
cs: Přidána podpora pro pojmenování telefonních čísel a linek.

source: Add summary command to print short overview.
cs: Přidán příkaz pro výpis souhrnu stavu účtu.

source: Added support for listing lines information.
cs: Přidána podpora pro výpis informací o linkách.

source: Added support for listing data usage for all lines on current account.
cs: Přidána podpora pro výpis využití dat pro všechny linky na účtě.

source: Documentation improvements.
cs: Vylepšené dokumentace.

source: Added html output to the program.
cs: Přidána možnost HTML výstupu.

source: Added support for json and csv output.
cs: Přidána podpora pro výstup ve formátu JSON a CSV.

source: Improved command line support for API calls.
cs: Vylepšená podpora pro přímé volání API z příkazové řádky.

source: Command line parameters can now override config file.
cs: Parametry z příkazové řádky mohou měnit nastavení z konfiguračního souboru.

source: Added support for initiating callback.
cs: Přidána podpora pro zpětné volání.

source: Initial release.
cs: První vydání.

source: Support for getting data usage.
cs: Přidána podpora pro výpis využití dat.

source: Support for getting current balance.
cs: Přidána podpora pro zjištění zůstatku.

source: Support for sending messages.
cs: Přidána podpora pro posílání zpráv.
