Repository: nijel/odorik
Catalog: docs/locale/*/LC_MESSAGES/python.po
Languages: cs

source: Base class for all exceptions.
cs: Základní třída pro výjimky.

source: User ID
cs: ID uživatele

source: API password
cs: API heslo

source: API server URL, if not specified default is used
cs: URL API serveru, pokud není zadáno použije se výchozí

source: Configuration object, overrides any other parameters.
cs: Objekt s nastaveními, přepíše jakékoliv jiné parametry.

source: Access class to the API, define user, password and optionally API URL.
cs: Hlavní třída pro přístup k API. Zadejte uživatele, heslo a volitelně URL API.

source: Request path
cs: Cesta požadavku

source: Optional request parameters
cs: Volitelné parametry požadavku

source: Performs single API GET call.
cs: Provede jeden GET API požadavek.

source: Performs single API GET call and parses JSON reply including error handling.
cs: Provede jeden GET API požadavek a zpracuje odpověď ve formátu JSON včetně případného ošetření chyb.

source: Returns current balance.
cs: Vrátí aktuální zůstatek.

source: Starting date
cs: Počáteční datum

source: Ending date
cs: Koncové datum

source: Phone number in form of 00420789123456
cs: Telefonní číslo ve tvaru 00420789123456

source: Returns mobile data usage list in given interval. Optionally filtered for given number.
cs: Vrátí využití dat v zadaném časovém intervalu. Volitelně může být filtrován pro zadanou linku.

source: Number where to sent SMS.
cs: Číslo kam odeslat SMS.

source: Text of the message.
cs: Text zprávy.

source: Optional sender number.
cs: Volitelné číslo odesílatele.

source: Sends a SMS message.
cs: Odešle SMS zprávu.

source: Number which is calling.
cs: Číslo, které volá.

source: Number to call.
cs: Číslo, které se má zavolat.

source: Line to use for accounting.
cs: Jakou linku použít pro vyúčtování.

source: Initiates callback.
cs: Objedná zpětné volání.

source: Line to use for listing
cs: Jakou linku použít pro výpis

source: Returns list of calls in given interval. Optionally filtered for given line.
cs: Vrátí seznam hovorů v zadaném časovém intervalu. Volitelně může být filtrován pro zadanou linku.

source: Returns list of sms in given interval. Optionally filtered for given line.
cs: Vrátí seznam SMS v zadaném časovém intervalu. Volitelně může být filtrován pro zadanou linku.

source: Returns list of dictionaries with information about lines.
cs: Vrátí seznam slovníků s informacemi o linkách.

source: Configuration section to use
cs: Jakou sekci konfiguračního použít

source: Configuration file parser following XDG specification.
cs: Zpracování konfiguračního souboru podle specifikace XDG.

source: Path where to load configuration.
cs: Cesta k souboru s konfigurací.

source: Loads configuration from a file, if none is specified it loads from `odorik` configuration file placed in XDG configuration path (:file:`~/.config/odorik` and :file:`/etc/xdg/odorik`).
cs: Načte nastavení z konfiguračního souboru. Pokud není zadána cesta, použije se soubor `odorik` umístěný v cestě XDG (:file:`~/.config/odorik` a :file:`/etc/xdg/odorik`).

source: settings to override
cs: vynutit změnu těchto nastavení

source: stdout for printing output, uses ``sys.stdout`` as default
cs: výstup pro vypisování textu, pokud není zadáno použije ``sys.stdout``

source: command line argumets to process, uses ``sys.args`` as default
cs: parametry z příkazové řádky pro zpracování, pokud není zadáno použije ``sys.args``

source: Main entry point for command line interface.
cs: Hlavní funkce pro příkazovou řádku.

source: Decorator to register :class:`Command` class in main parser used by :func:`main`.
cs: Dekorátor, který registruje třídu :class:`Command` pro zpracování v parseru funkce :func:`main`.

source: Main class for invoking commands.
cs: Hlavní třída pro spouštění příkazů.

source: Call status, one of 'answered', 'missed'
cs: Stav hovoru, jedno z 'answered', 'missed'

source: Call direction, one of 'in', 'out', 'redirected'
cs: Směr hovoru, jedno z 'in', 'out', 'redirected'

source: string
cs: řetězec

source: object
cs: objekt

source: float
cs: desetinné číslo

source: list
cs: seznam
